[
    {
        "image": "https://i.ibb.co/fXmcn2n/Addictive-Cucumber.jpg",
        "title": "Addictive Cucumber",
        "description": "You'll never look at cabbage the same way again once you've tasted this Japanese Izakaya style yamitsuki cabbage! Crunchy pieces of fresh cabbage tossed in sesame seeds and seasonings to create the ultimate umami bomb. Even if you don't like cabbage, I guarantee this dish will change your mind! As the name suggests, Japanese salted cabbage is a simple side dish made with raw cabbage that has been sprinkled with salt and other seasonings. Despite its simplicity, it's truly a delicious and addictive dish. Known as yamitsuki (やみつき) or addictive cabbage in Japanese, these salted cabbage side dishes are often served in izakaya (Japanese pubs) or yakiniku (Korean BBQ) restaurants, where people often gather to drink and eat. This type of dish is sometimes called shio kyabetsu (salt cabbage) depending on the restaurant. The cabbage has a fresh and crunchy texture while the seasonings add umami, yamitsuki cabbage is seriously addictive and some places even offer a free refill service. I always end up ordering refills without a fail. I absolutely love this dish! This recipe is my version of an izakaya style Addictive salty cabbage. It's a 5 minute dish which is very cheap and easy to make, I highly recommend it! We say yamitsuki cabbage, but first let me elaborate on what yamitsuki means in Japanese. Yamitsuki (やみつき) is a Japanese term for being so drawn to something that you can't help but enjoy it over and over. It's often used for food, drinks, hobbies, or habits that people find satisfying and fun. For example, if someone can't stop eating a snack once they start, they're addicted (yamitsuki) to it. They love its taste and texture so much that they just want to keep eating. What makes something yamitsuki varies for each person, but they all share the ability to bring joy and satisfaction, making people want to enjoy them over and over again.",
        "tags": [],
        "categories": ["global"],
        "myfevorite": [],
        "comments": [],
        "publishedAt": "jan 31, 2023",
        "modifiedAt": "",
        "createdBy": "Mahabub"
    },
    {
        "image": "https://i.ibb.co/jDXbWFx/Addictive-Cabbage.jpg",
        "title": "Addictive Cabbage",
        "description": "There is not much to say about cutting cabbage, basically cut bite-size in your style. Just avoid cutting too small since the cabbage will be watery gradually. Tearing leaves with fingers is a good way to prevent the dish from getting watery. When using Napa cabbage, shred napa cabbage instead of cutting pieces since it slightly has habits. Salt has a variety of colors and textures to enhance the flavor of your dishes and make them more savory. Especially, this dish is used supreme simple ingredients, yes, raw cabbage, choose one of the best salt with healthy and tasty. Some salts such as pink Himalayan salt and other different types of natural sea salt are considered tastier and healthier (means contain minerals ) compared with regular table salt. As well as the mineral salt, let’s upgrade your dusty and sticky toast sesame oil in your kitchen or never opened. Yamituski cabbage is almost determined whether tasty or not depends on the toasted sesame oil. Personally, I prefer Korean or Japanese toasted sesame oil to buy for Yamitsuki Cabbage. Toasted sesame oil is known for its aroma that makes you hungry all the time you smell it, besides, it is known as one of the healthy oil. Sesame oil is rich in unsaturated butyric acid, such as the essential fatty acid linoleic acid, and also contains sesamin and vitamin E, which are high in antioxidants. Yamitsuki cabbage is the supreme simple taste (but yummy) with sweet earthy cabbage, mild savory salt, and aromatic luxury toasted sesame oil. While you can enjoy this simple vegetable snack as simple as it is, you can twist the seasonings to make it more flavorful. I recommend adding more seasonings when using cannonball cabbage (green cabbage) since it is not sweet as Jaroma cabbage or sweetheart cabbage.",
        "tags": [],
        "categories": ["global"],
        "myfevorite": [],
        "comments": [],
        "publishedAt": "jan 31, 2023",
        "modifiedAt": "",
        "createdBy": "Mahabub"
    },
    {
        "image": "https://i.ibb.co/Wv26wLb/Edamame.jpg",
        "title": "Edamame",
        "description": "Hey guys, it's Yuto here from @sudachi.recipes and today I'm going to share a recipe which will take edamame beans to a whole new level. These flavorful izakaya inspired garlic and oyster sauce fried edamame are addictive, you won't be able to stop eating them! So first, what are edamame? Edamame are a type of young green soybean that are sold still in their pods. The beans are picked before they ripen which is why they are green rather than the beige or brown soybeans you might expect. Because they are picked before they are ripe, they have a slight sweetness and nice soft texture. The name edamame comes the words (枝) which means branch, and (豆) which means bean. This is because they are usually sold still on their branches. In Japan, the edamame are usually blanched in 4% salt water. Although edamame are usually sold in their pods, you do not eat the pods! Edamame are usually served as an appetizer, snack or side dish. The most common way to eat edamame is to put the pod in your mouth and bite softly between the beans, sliding the pod between your teeth to pull out the soybeans inside. Any flavour on the outside of the bean won't be on the beans themselves, but your teeth and tongue will catch the flavour. If you push the beans out of the pod by hand, you can also use them in onigiri or salads. The frozen type are really not that different to the raw ones. They are usually already trimmed and already blanched so when you boil them again, it takes less time. Fresh edamame need to be boiled for 5-7 minutes whereas frozen ones only need a couple of minutes. In addition to the convenience, frozen edamame can be kept for a long time. If you want to make your own frozen edamame, you can prep the raw ones by washing and then boiling for 4 minutes. Pop them in a freezer bag and save them for another day. They're good for 10-12 months!",
        "tags": [],
        "categories": ["global"],
        "myfevorite": [],
        "comments": [],
        "publishedAt": "jan 31, 2023",
        "modifiedAt": "",
        "createdBy": "Mahabub"
    },
    {
        "image": "https://i.ibb.co/mvzgccB/Fried-Lotus-Roots.jpg",
        "title": "Fried Lotus Roots",
        "description": "Kurozuankake is a Japanese style of sweet and sour sauce made with black vinegar called kurozu. It's a kind of aged rice vinegar that is dark in colour and quite subtle in flavour. It's not too sour and some compare it to balsamic vinegar, but a little less sweet. If you need a substitute, you can mix 1 tsp of balsamic vinegar with 1 tsp of rice vinegar. You can buy Japanese Kurozu black vinegar on Amazon here. Ankake means thick, sweet sauce. This refers to the thick, syrup like texture of the sauce that helps it stick to the meat and vegetables. This sauce can be bought pre-made in Japanese supermarkets, but I'm going to show you how to make it from scratch! It's a nicely balanced sweet and sour sauce that is perfect for stir fries! The main cooking method used for this dish is shallow frying. The vegetables are fried first and then the chicken is coated in starch and fried too. Frying at a high temperature is what gives the vegetables a nice crunch and the chicken a crispy outside. Frying is the technique that Ootoya uses, so for this recreation recipe I will be following the same technique. But there are some other options for if you don't want to shallow fry. Ootoya is a popular chain restaurant in Japan that serves teishoku style meals. If you visit Japan, I definitely recommend going there! They have a great range of typical Japanese dishes on the menu, their ingredients are fresh and everything is made on site (no frozen stuff). Some stores even have a touch screen menu with language options in English, it's very convenient! I go there whenever I feel like something filling and comforting. They state on their website that kurozuan is the most popular item on their menu and basically their signature dish. The official recipe is even posted online! (Japanese) My version is simplified and uses more accessible ingredients, but when it comes to taste, I honestly don't think you'll be able to tell the difference!",
        "tags": [],
        "categories": ["global"],
        "myfevorite": [],
        "comments": [],
        "publishedAt": "jan 31, 2023",
        "modifiedAt": "",
        "createdBy": "Mahabub"
    },
    {
        "image": "https://i.ibb.co/ZXYFJ5G/Fried-Oyster.jpg",
        "title": "Fried Oyster",
        "description": "Hey guys, it's Yuto here from @sudachi.recipes and today I'm going to share a recipe which will take edamame beans to a whole new level. These flavorful izakaya inspired garlic and oyster sauce fried edamame are addictive, you won't be able to stop eating them! So first, what are edamame? Edamame are a type of young green soybean that are sold still in their pods. The beans are picked before they ripen which is why they are green rather than the beige or brown soybeans you might expect. Because they are picked before they are ripe, they have a slight sweetness and nice soft texture. The name edamame comes the words eda (枝) which means branch, and mame (豆) which means bean. This is because they are usually sold still on their branches. In Japan, the edamame are usually blanched in 4% salt water. Although edamame are usually sold in their pods, you do not eat the pods! Edamame are usually served as an appetizer, snack or side dish. The most common way to eat edamame is to put the pod in your mouth and bite softly between the beans, sliding the pod between your teeth to pull out the soybeans inside. Any flavour on the outside of the bean won't be on the beans themselves, but your teeth and tongue will catch the flavour. If you push the beans out of the pod by hand, you can also use them in onigiri or salads. The frozen type are really not that different to the raw ones. They are usually already trimmed and already blanched so when you boil them again, it takes less time. Fresh edamame need to be boiled for 5-7 minutes whereas frozen ones only need a couple of minutes. In addition to the convenience, frozen edamame can be kept for a long time. If you want to make your own frozen edamame, you can prep the raw ones by washing and then boiling for 4 minutes. Pop them in a freezer bag and save them for another day. They're good for 10-12 months!",
        "tags": [],
        "categories": ["global"],
        "myfevorite": [],
        "comments": [],
        "publishedAt": "jan 31, 2023",
        "modifiedAt": "",
        "createdBy": "Mahabub"
    },
    {
        "image": "https://i.ibb.co/gFmVzgn/Fried-Smelt.jpg",
        "title": "Fried Smelt",
        "description": "This delicious Chicken Nanban consists of fried chicken cooked in a sweet vinegar sauce and then topped with rich homemade Japanese tartar sauce. This dish was created in Miyazaki prefecture, Southern Japan and has influences from Portugal. It is now one of the most popular fried chicken dishes in Japan and you can make it from scratch in your own kitchen! Chicken Nanban is a popular Western style yoshoku dish from Japan. Succulent chicken thigh is coated in egg and potato starch, deep fried and then coated in a tangy, sweet nanban sauce. Lastly, the dish is topped with a rich and creamy Japanese style tartar sauce. You can find chicken nanban in restaurants, homes, bento boxes and convenience stores. With all these flavours and textures going on, it's easy to see why chicken nanban is such a well-loved dish in Japan! Chicken nanban is most commonly served with shredded cabbage or salad, and rice. But it's a versatile dish, it also goes great with fries! Chicken nanban is considered the soul food of Nobeoka, a city in Miyazaki Prefecture, Kyushu, the southern island of Japan. The dish was originally created in the 1960's and was served to workers at the Western style restaurant London. One apprentice went on to open his own restaurant called Naochan, serving dishes that before this point, were only served to the other cooks. Chicken Nanban became popular all over the city and travelled across Japan to large cities like Tokyo and Osaka. It came to be one of the most popular fried chicken dishes in Japan!",
        "tags": [],
        "categories": ["global"],
        "myfevorite": [],
        "comments": [],
        "publishedAt": "jan 31, 2023",
        "modifiedAt": "",
        "createdBy": "Mahabub"
    },
    {
        "image": "https://i.ibb.co/7t2qNkc/Miso-Soup.jpg",
        "title": "Miso Soup",
        "description": "Did you know you can make restaurant-worthy miso soup in the comfort of your own home? Well, you can! You just need a good recipe — and that's where we come in. This miso soup recipe is bold, flavorful, and easy to make with just five ingredients. Miso soup is a traditional Japanese soup that starts with a dashi stock and is flavored with miso paste. Dashi is an umami-rich stock made from dried seaweed and dried fish. Miso paste, meanwhile, is a paste made from soybeans, salt, and koji rice. The brothy soup usually contains tofu and green onions. It can also feature seaweed, mushrooms, daikon, and more. Miso soup is traditionally served with rice. Yes! Miso soup freezes well. Transfer the cooled soup to zip-top bags or ice trays, then freeze for up to two months. If you use freezer bags, make sure you leave about an inch of room at the top to allow for expansion. We recommend adding the tofu and green onions after you thaw the soup. Easy to make and tasty, according to Brownie5. Made it for my husband when he wasn't feeling well. Wanted to give him something else instead of the chicken noodle soup he's been drinking. The tofu is a good source of protein to fill his stomach. I was looking to replicate the taste of restaurant miso soup at home, says Earnest Cavalli. This does the job perfectly. That said, I prefer firm tofu to silky, but that's a personal taste thing. Either works great in this recipe. I've made this several times now and always make a huge batch to freeze, according to lnos. Made it exactly with the addition of seaweed. Love this! Editorial contributions by Corey Williams. Combine water and dashi granules in a medium saucepan over medium-high heat; bring to a boil. Reduce heat to medium and whisk in miso paste. Stir in tofu. Separate the layers of green onions, and add them to the soup. Simmer gently for 2 to 3 minutes before serving.",
        "tags": [],
        "categories": ["global"],
        "myfevorite": [],
        "comments": [],
        "publishedAt": "jan 31, 2023",
        "modifiedAt": "",
        "createdBy": "Mahabub"
    },
    {
        "image": "https://i.ibb.co/bdNwqwW/Shishitou-pepper.jpg",
        "title": "Shishitou Pepper",
        "description": "Are you acquainted with shishito peppers? They are thin-skinned little green peppers that you can cook up in a skillet in ten minutes. Once they have a little char on them, they’re so irresistible. Nine out of ten shishitos are quite mild, but then you’ll come across one that makes your eyes water! That’s part of the fun. I’ve been craving blistered shishitos since we returned from Spain, where we found the shishito’s cousins cooked the same way. So, I’ve been scooping them up at Whole Foods, and tossing them in a skillet at home. It took me a few tries to get my technique down. Most recipes will tell you to cook the peppers over high heat, but that will fill your kitchen with smoke. I’ve dialed down the heat and figured out how to make consistently great blistered shishitos. Ready for the easiest appetizer recipe ever. Blistered shishito peppers are so easy to cook that you’ll know this recipe by heart after your first try. I offer exact amounts of peppers and oil below, but you really just need enough peppers to cover the base of your skillet and enough oil to lightly coat the peppers. Meet shishito’s cousins, which you can cook up the same way. Shishitos are easier to find in the States, so that’s why they’re featured in the title of this post. Shishito peppers hale from East Asia, and I’ve ordered them as an appetizer from sushi menus. They are small green peppers that look like wrinkled, thin-skinned jalapeños. Don’t worry, they aren’t nearly as spicy (well, 90 percent are not). We found guindilla peppers in San Sebastián in Northern Spain. They’re skinnier than shishitos, and my favorite variety. You’ll also find them pickled in vinegar, and they taste like spicy, firm pepperoncini peppers. The first time we ordered blistered guindillas, my husband assumed we couldn’t possibly finish off the full bowl and offered them to our neighbors for a taste. I admired his generosity while I reached for another, and another, and before you knew it, I polished them off myself. Guindillas are a Basque specialty, and I’ve never seen them elsewhere. I love them so much I’ve found seeds to plant next year.",
        "tags": [],
        "categories": ["global"],
        "myfevorite": [],
        "comments": [],
        "publishedAt": "jan 31, 2023",
        "modifiedAt": "",
        "createdBy": "Mahabub"
    },
    {
        "image": "https://i.ibb.co/ZT26x83/Thick-Fried-Tofu.jpg",
        "title": "Thick Fried Tofu",
        "description": "Atsuage is a versatile preparation of tofu that’s both a dish and an ingredient in Japanese cuisine. Deep frying the whole block of tofu develops a meaty golden brown skin on the outside while the inside remains tender and creamy. When eaten fresh from the fryer, the golden brown crust is crispy and quickly absorbs any seasoning you pour over it. This makes it a delicious alternative to hiyayakko (chilled tofu) and yudoufu (boiled tofu). The first thing you need to do is drain the tofu of excess water. I find that salting helps to draw the water out faster. Just sprinkle every surface of the blocks of tofu with salt and set them on a wire rack set over a try. Set another tray on top of the tofu and weigh it down with water or cans. Don’t go overboard with the weight, or the tofu will crumble. I usually let the tofu drain for about an hour. When the tofu is almost ready to fry, start preheating two to three inches of vegetable oil in a heavy-bottomed pot to 340°F (170°C) over medium heat. Use a deep pot, and not a frying pan here because the high moisture content of the tofu can cause the oil to bubble over if the pot you use is too shallow. I also like to add a bit of toasted sesame oil to give the Atsuage a nice nutty flavor. Wipe off any excess moisture on the surface of the tofu with a paper towel and gently lower the blocks into the oil. I recommend using long chopsticks or tongs as a ramp to gently slide the tofu into the oil, so you don’t splash oil all over the place. Fry the tofu on one side for 4-5 minutes, flip it over, and fry the other side for another 4-5 minutes or until the surface of the tofu is golden brown and crisp. Transfer the fried tofu to a paper towel-lined rack to drain off any excess oil. The fresh Atsuage cut into bite-size pieces can be served hot with condiments such as chopped scallions and grated ginger with soy sauce. However, if you plan to use it as an ingredient in other Japanese dishes, let it cool to room temperature, and then you can store it in a sealed container in the refrigerator until you’re ready to use. Atsuage or atsu-age literally means “thick fried” in Japanese and refers to a preparation of tofu made by deep frying a whole block of tofu. It is also sometimes called nama-age due to the fact that it’s not fried all the way through. It can be eaten seasoned with condiments such as soy sauce and ponzu, but it’s also commonly used as a plant-based ingredient in Japanese cooking.",
        "tags": [],
        "categories": ["global"],
        "myfevorite": [],
        "comments": [],
        "publishedAt": "jan 31, 2023",
        "modifiedAt": "",
        "createdBy": "Mahabub"
    },
    {
        "image": "https://i.ibb.co/4V9Fy5d/Grilled-Mackerel.jpg",
        "title": "Grilled Mackerel",
        "description": "Grilled Mackerel or Saba Shioyaki (鯖の塩焼き) is one of the popular seafood dishes served as an entree or part of a bento combination in Japanese restaurants in the U.S. You may already know this, but what you may not know is how fast and easy it is to make this grilled fish at home. This is the reason I love making this for my family dinner — it feels special, but is so very simple. Saba (鯖) is mackerel and Shioyaki (塩焼き) means salt (shio) and grilling (yaki). As you can guess, the only seasoning we need for this dish is salt, which brings out the rich flavors of mackerel. Anyone can just season with salt and cook, and call it a recipe; however, I’ll show you a few tips you can use to make the dish extra delicious! If you’re familiar with Japanese cooking, you’d notice that the majority of recipes call for sake (Japanese rice wine). There are many benefits of using sake in Japanese cuisine, and this recipe is no exception. Salt is used not only to season the fish, but it also extracts water from the fish and eliminates any unpleasant smell. Once you sprinkle the mackerel with salt, let it rest for 20 minutes. Do not let it sit anytime shorter or longer. If it is rested too short a time, the fish does not soak up enough salty flavor and the smell may still linger. On the other hand, if you rest it for too long, the smell may be gone but the flesh will get too tight and lose its texture. ",
        "tags": [],
        "categories": ["appetizer"],
        "myfevorite": [],
        "comments": [],
        "publishedAt": "jan 31, 2023",
        "modifiedAt": "",
        "createdBy": "Mahabub"
    },
    {
        "image": "https://i.ibb.co/HVLZs2g/Sake-Steamed-Clams.jpg",
        "title": "Sake Steamed Clams",
        "description": "Japanese Sake-Steamed Clams made in 10 minutes with just 5 ingredients! A favorite of izakaya, this seafood fare exudes a fun casual vibe when enjoyed with chilled beer. Expect minimal fuss and maximum flavors! One of the easiest appetizers we can make at home is these Japanese Sake-Steamed Clams, or what we call Asari no Sakamushi (あさりの酒蒸し). It is impossibly flavorful, and takes just 10 minutes and 5 ingredients to make. A perfect dish to start your meal with family and friends! Have you had steamed clams before? Steamed clams are a seafood dish consisting of clams cooked by steaming, and often seasoned with garlic, butter, white wine, etc. In Japan, we enjoy a similar dish but we steam clams in sake, the Japanese rice wine, with a few aromatics. The simplicity of the seasonings brings out the delicious brininess of the clams, and the result is unbeatable. If you have frequented izakaya (Japanese pubs), you’d notice Sake Steamed Clams on the menus, because it’s best enjoyed with chilled glass of foamy beer or sake. While this seafood dish might look and taste luxurious, anyone can pull it off easily. I love serving steamed clams on summer nights over a bonfire, when everyone is relaxing and sharing good food and chatters. If you are familiar with Japanese cuisine, you would probably notice the rare appearance of red chili pepper. Once in a while, we will use a dried red chili pepper (always just one!) in a dish to give some kick and a tiny bit of heat. We remove seeds completely, otherwise, it would be too spicy for the Japanese taste. But if you like it spicy, then just add more. I highly recommend cleaning the clams even when the package or fishmongers say the clams are “ready to use”. I often taste sand in them, and you don’t want to experience that when you enjoy the delicious clams. You can read and follow my detailed tutorial. I always clean the clams as soon as I bring them home. If you don’t use the clams right away, you can keep them in the refrigerator for several days by storing in a container with a moist paper towel over the top.",
        "tags": [],
        "categories": ["appetizer"],
        "myfevorite": [],
        "comments": [],
        "publishedAt": "jan 31, 2023",
        "modifiedAt": "",
        "createdBy": "Mahabub"
    },
    {
        "image": "https://i.ibb.co/MC6dZ4G/Tuna-Yukke.jpg",
        "title": "Tuna Yukke",
        "description": "Maguro zuke don (マグロ漬け丼) is a type of rice bowl topped with marinated raw tuna. You can often find it served in teishoku style restaurants or sometimes Japanese style pubs we call izakaya. To be honest, this dish is not commonly made at home, even in Japan. However it's extremely simple to make, so why not? There are two popular types of raw tuna bowls, one is maguro don (マグロ丼) and the other is called tekka don (鉄火丼). While they look the same to the untrained eye, there are actually small technical differences between tekka don and maguro don. To be honest, it's almost never mentioned anywhere and even I didn't know until recently, but here are the key differences! So basically, the main differences are whether you use sushi rice or regular unseasoned rice and which part of the tuna you use. They are such small details that many Japanese people also don't know the difference between the two, but I thought it's interesting to mention! With this in mind, it's up to you whether you make tekka don or maguro don, you can make either by following my recipe! I like to marinate the tuna for about 30 minutes. You can marinate it longer than this but be aware that colour of the tuna will get darker as the time goes by, and the flavour will get stronger too. It depends on your preference! As maguro zuke don is made with raw tuna, the most important thing is to use tuna that is fresh and specifically labelled as sashimi-grade or sushi-grade. Sushi-grade fish is prepared in such a way that it is safe to eat at home raw. As for which part of the tuna to use, generally you can use any part. Just keep in mind that if you specifically want to make tekka don, you can only use the red part of the tuna. (If you use the pink, fattier parts, then the dish will become maguro don.)",
        "tags": [],
        "categories": ["appetizer"],
        "myfevorite": [],
        "comments": [],
        "publishedAt": "jan 31, 2023",
        "modifiedAt": "",
        "createdBy": "Mahabub"
    },
    {
        "image": "https://i.ibb.co/yPC75bW/Grilled-Eggplant.jpg",
        "title": "Grilled Eggplant",
        "description": "These Garlic & Herb Grilled Eggplant are my favourite vegetable to barbecue. They are tender in the middle with slightly charred edges and are coated in a delicious garlic and herb oil which gives them so much flavour. They are Vegan, Whole30, Keto and Paleo and guaranteed to be a crowd pleaser. Grilled vegetables are my go to side dish for any summer barbecue. They are incredibly easy to prepare, go with just about anything, and can be made in advance. While most people grill zucchini, peppers and onions, my absolute favourite vegetable to grill is eggplant. Unfortunately grilled eggplant (or melanzane, aubergine or brinjals depending on where in the world you are from) can be a tricky vegetable to cook. Too much oil and they become slimy, cut too thick and they have an unpleasant chunky texture. It took me a trip to Italy where I spent time watching the way the locals prepared it before I finally learned how to grill eggplant.",
        "tags": [],
        "categories": ["nigri sushi"],
        "myfevorite": [],
        "comments": [],
        "publishedAt": "jan 31, 2023",
        "modifiedAt": "",
        "createdBy": "Mahabub"
    },
    {
        "image": "https://i.ibb.co/WFpD30m/Salmon-Nigiri.jpg",
        "title": "Salmon Nigiri",
        "description": "Cook Sushi Rice: Best salmon nigiri starts with high-quality sushi rice. Japanese short-grain sushi rice works the best. Once the rice is cooked, transfer it to a large bowl and let it cool down slightly. When it’s still very warm, season with sushi vinegar (or white vinegar, sugar and salt). Shape the Rice: Take about 3 tablespoons of rice in your right hand. Squeeze it together until it rolls into a firm oval shape. Try to make the bottom flat with a rounded top. Add Wasabi to Salmon: Place the salmon slice on the root of your fingers. Then take a pea-sized portion of wasabi, and spread in the middle of the fish. This is an optional step, and you can skip it if you don’t have wasabi.2. Slice the Salmon: Cut the salmon against the grain, with about 30 to 45 degree angle. You’ll need to adjust the angle from time to time to get the proper length and thickness. I recommend cutting it to 3-inch long, 1-inch wide, and 1/4-inch thick pieces. If you’d like to use smoked salmon for this recipe, you can simply swap smoked salmon for raw salmon, and follow the same instructions. If you like Philadelphia Roll Sushi, you’ll love smoked salmon nigiri. While salmon nigiri is best served fresh, you can prepare it 1 day ahead of time in a pinch. Any longer and the fish may not be fresh enough and/or bacteria growth could pose food safety risks. Traditional salmon nigiri recipe calls for raw salmon, and you’ll need to buy sashimi-grade salmon. Usually you can find it at your local Japanese grocery stores. Place the fish on ice before cooking, and it’s best to eat it the same day. If you don’t like the idea of eating raw fish, substitute smoked salmon, or cooked salmon (thinly sliced). Salmon nigiri consists a slice of raw salmon served over pressed vinegar rice. Salmon sashimi is not sushi, and doesn’t have rice. It refers to just slices of raw salmon, often served over shredded daikon radish.",
        "tags": [],
        "categories": ["nigri sushi"],
        "myfevorite": [],
        "comments": [],
        "publishedAt": "jan 31, 2023",
        "modifiedAt": "",
        "createdBy": "Mahabub"
    },
    {
        "image": "https://i.ibb.co/tXrPG5Z/Salmon-Roe-Gunkan.jpg",
        "title": "Salmon Roe Gunkan",
        "description": "Ikura (also called red caviar or salmon caviar) is salmon roe, and is one of the more popular items on the sushi menu, even though it is not native to Japanese waters. Not to be confused with tobiko or masago, it is readily distinguished because of its significantly larger size, like small, soft marbles, slightly transparent, and ranges in color from a deep, dark orange to a robust red. This is due to antioxidant pigments known as carotenoids which themselves are quite healthy, and also referred to as “red caviar due to the color. It is eaten often by itself, used as a garnish (also adding flavor), and in a number of different dishes such as scrambled eggs. At a restaurant, ikura sushi is typically prepared as gunkan-maki, which is a short strip of nori (seaweed) wrapped around the shari (bed of sushi rice) as otherwise the roe wouldn’t hold together. The cup-like gunkan-maki is the most effective presentation, holding the salmon roe in place. Often, a raw quail egg yolk is place on top, offering additional creaminess and complexity to the dish without interfering much with the unique flavor profile. Ikura is extremely popular in sushi, chazuke, or in ikura-don, which is a rice bowl topped with a layer of ikura. While today ikura only refers to salmon roe, the name is believed to have originated with the Russian word “ikra,” meaning “fish eggs.” Both ikura and salmon were not Japanese staples until the 1980’s after a very successful Norwegian advertising campaign introduced the items to Japan, where it was quickly accepted and became a common menu item everywhere. Of course it can be difficult to find high quality fresh ikura as most has been previously frozen after harvest so that it can be stored and transported easily. You can tell the difference as fresh ikura has a firm, taught outer skin while thawed will sag a bit and can even leak, so the latter has a limited shelf-life when thawed. Ikura has a slightly different taste during different parts of the year as well (it is “in season” during fall and winter but as it can be frozen is available all year round) depending on the curing process. While some “sujiko” (what the egg casing is called in Japanese) comes from wild salmon, the majority of the roe comes from farmed salmon, which guarantees a steady supply and also fortunately tastes no different than the roe from wild salmon. Prior to curing, the eggs are a deeper red color and slightly sweeter, but once cured, the ikura color lightens a bit and the now firm roe will pop in one’s mouth releasing a sweet, briny, and slightly fishy flavor richly enjoyed in Japan and around the world.",
        "tags": [],
        "categories": ["nigri sushi"],
        "myfevorite": [],
        "comments": [],
        "publishedAt": "jan 31, 2023",
        "modifiedAt": "",
        "createdBy": "Mahabub"
    },
    {
        "image": "https://i.ibb.co/tQydNLC/Salmon-Sashimi.jpg",
        "title": "Salmon Sashimi",
        "description": "If you want to know how to prepare salmon sashimi (sake sashimi) or salmon nigiri, you have come to the right place! Sashimi (meaning pierced meat) is thinly sliced raw fish served without rice. Nigiri is served over sushi rice. Salmon sashimi calories are quite reasonable at only 52 calories per oz. An average serving size of sashimi can range from 5-8 pieces with each piece ranging from 0.5 to 1 oz. Mix soy sauce and citrus yuzu ponzu sauce for a delicious dipping sauce. They can also be used as separate dipping sauces. If you would like to make garlic ponzu sauce, you can add a pinch of pressed or finely minced garlic to your ponzu. This yuzi was made popular by Nobu. You can also add a splash of rice vinegar or sesame oil for some extra layers of flavor. The first trick to cutting salmon sashimi or smoked salmon sashimi is to be sure that your knife is well sharpened. You might also consider purchasing a sushi knife if you want to make sushi or sashimi more frequently. Be sure that you have a very stable base to cut your fish and that the cutting board will not slide. Slice salmon fish into thin rectangular slices about ¼ inch thick or your preference) for this salmon sashimi recipe. This type of slice is used for tuna sashimi, albacore sashimi and yellowtail tuna sashimi. This video on how to slice salmon sashimi is very helpful. While you can be very precise about how you slice your fish, ultimately the most important tips are to slice thinly, use a sharp sushi knife and cut against the grain of the fish for optimal texture.",
        "tags": [],
        "categories": ["popular sashimi"],
        "myfevorite": [],
        "comments": [],
        "publishedAt": "jan 31, 2023",
        "modifiedAt": "",
        "createdBy": "Mahabub"
    },
    {
        "image": "https://i.ibb.co/j4bCZn1/Scallop-Sashimi.jpg",
        "title": "Scallop Sashimi",
        "description": "I am a HUGE fan of scallops. I love ordering them at the restaurant, and we love to cook them at home. More recently, I have been experimenting with raw scallop recipes. And of course, when I do experiment with different ingredients, I will try to add them to a salad. So when I received a tub of native finger limes from our friends All Aussie Farmers, it was time to experiment with the two fascinating ingredients together. Citrus is a natural partner with scallops. Fingers limes, although technically not in the broader citrus family, tastes like lime. Therefore it was a no brainer to try to combine scallops with finger limes. For left over finger limes, you can’t go past our Cucumber Finger Lime Salad. I created an elegant Japanese style sashimi salad with fresh scallops on a pool of ruby grapefruit dressing with pops of finger lime pearls and tobiko scattered on top. The flavours are delicate, zesty and succulent. For seafood lovers, this combination is a definite winner. I tested this scallop sashimi salad on my family and friends. The result was the same—all happy faces. Yes, definitely. You can eat scallop raw. Cooked and raw scallops do have different flavours and texture. Raw scallops have a softer, smoother texture with a sweeter taste compared to cooked scallops. I find the taste of cooked scallops light but also rich at the same time. Similar to cooked lobster, cooked scallops are firmer and have a succulent texture. Unlike some other shellfish, there is less fishy taste in scallops but still retains a sweet, briny essence. There are a few different ways to serve raw scallops. Scallop sushi is a popular choice with a butterflied raw scallop served on top of a nugget of sushi rice. Other options include scallop carpaccio and scallop ceviche. He created this inventive way of serving when a customer returned a plate of sashimi to the kitchen as he did not like raw fish. Nobu’s recipe, new style salmon sashimi, starts with a plate of thinly sliced salmon sashimi and a heated sauce is poured over the fish to essentially “cook” it. The result is still a delicate plate of partially raw fish but seasoned with a savoury and sweet sauce. This also removes the need for soy sauce for dipping. Now I see many different variations of the sashimi recipes ranging from thinly sliced raw seafood or meats accompanied with savoury sauces, citrus, spices, aromates, micro herbs and various fragrant oils.",
        "tags": [],
        "categories": ["popular sashimi"],
        "myfevorite": [],
        "comments": [],
        "publishedAt": "jan 31, 2023",
        "modifiedAt": "",
        "createdBy": "Mahabub"
    },
    {
        "image": "https://i.ibb.co/bdwGmQG/Spanish-Mackerel-Sashimi.jpg",
        "title": "Spanish Mackerel Sashimi",
        "description": "My friends and I are spoiled when it comes to fishing. We have so much water to fish, and there is a vast variety of species to pursue. It’s all about knowing when and where, and Rachel and I are lucky to know some people that have a pulse on the Bay. On a recent trip out for cobia, we put two large cobia on ice within 2 hours of launching the boat, then we switched the rods out to troll for spanish mackerel and bluefish. After a little bit of probing, we had more than enough for all of us to eat fresh fish for a couple of days, as well as put dozens of pounds of cobia steaks in the freezer. We try not to take more mackerel and bluefish than we plan on eating fresh, unless we have plans to smoke or pressure can some because neither of those oily fish freeze well raw. That evening, I sliced up a bunch of bluefish and mackerel and dressed them with a simple mixture of soy, ginger, and lemon juice. We ate that raw while we cooked cobia steaks on the grill. It has become one of our preferred ways to enjoy bluefish and mackerel. Both bluefish and mackerel often have a bad rep as table fare, but this is mostly due to poor handling. And despite the fact that it’s fairly uncommon for people to eat either of these fish raw in this region, we have found that if properly bled and cooled, you’d be hard pressed to find a better fish for sashimi-style preparations. I cut the gills and pack each bluefish and mackerel on as much ice as I can as we catch them- this helps the fish stay firm and keeps them in their best condition. Either of these fish kept on scant ice or worse, no ice, will get mushy and start tasting fishy in no time. Keep the fish as cold as you can and you’ll be rewarded with some of the best tasting fish there is. This recipe is super simple: mix the ingredients for the sauce and pour over the fresh fish. We make changes to this recipe depending on what we have on hand when we are preparing this dish away from home, but the key is to find the right balance of savory and acidic elements. Too much acid and the sauce will start to denature the proteins, which will change the texture to more of a ceviche instead of a sashimi or crudo. While there is nothing wrong with this, (mackerel and bluefish ceviche is very tasty) the sashimi preparation really allows the subtle textural qualities of these fish to shine. This recipe is best done with super fresh fish. Fish caught that day is best, but we have had luck with fish up to 24 hours old when the fish is left whole and packed on ice. Anything we don't eat fresh gets smoked or canned within two days. Between the bluefish and the mackerel, I’d be hard pressed to pick a favorite. But if forced, I’d say the mackerel outshines the blue by just a bit, only because I like the slight textural difference that the skin adds. Use either fish, or any super fresh fish, for this recipe, but if you’re from the camp that thinks the only good thing to do with bluefish or mackerel is smoking it and making dip, this might change your mind",
        "tags": [],
        "categories": ["popular sashimi"],
        "myfevorite": [],
        "comments": [],
        "publishedAt": "jan 31, 2023",
        "modifiedAt": "",
        "createdBy": "Mahabub"
    },
    {
        "image": "https://i.ibb.co/rtSypzv/Yellow-Tail-Sashimi.jpg",
        "title": "Yellow Tail Sashimi",
        "description": "If you want to know how to prepare yellowtail tuna sashimi or the nobu yellowtail jalapeno recipe, you have come to the right place! Sashimi (meaning pierced meat) is thinly sliced raw fish served without rice. Yellowtail or Hamachi fish is a type of tuna used in this sashimi recipe. Yellowtail sashimi calories are quite reasonable at only 36 calories per oz. An average serving size of sashimi can range from 5-8 pieces with each piece ranging from 0.5 to 1 oz. Yellowtail sashimi (or hamachi sashimi) is a healthy and light, protein packed appetizer, lunch or dinner option. If you love sushi, you should definitely check out this delicious Sweet Potato Sushi Roll, Salmon Tataki preparation as well as my Vegetable Sushi. Preparation requires less than 5 minutes and is a beautiful presentation for your next dinner party (or for you, because you deserve to be fancy!). You can also transform this dish into hamachi crudo by changing the garnish to a delicious olive oil and a dash of citrus or vinaigrette. The citrus yuzu ponzu sauce brings a tangy and rich umami flavor that works well with the spice of the sliced jalapeno! You might also enjoy a side of Chili Crisp for some extra heat. The first trick to cutting sashimi is to be sure that your knife is well sharpened. You might also consider purchasing a sushi knife if you want to make sushi or sashimi more frequently. Be sure that you have a very stable base to cut your fish and that the cutting board will not slide. Slice yellowtail tuna fish into thin rectangular slices about ¼ inch thick or your preference). This type of slice is used for tuna sashimi, albacore sashimi and yellowtail tuna sashimi.",
        "tags": [],
        "categories": ["popular sashimi"],
        "myfevorite": [],
        "comments": [],
        "publishedAt": "jan 31, 2023",
        "modifiedAt": "",
        "createdBy": "Mahabub"
    },
    {
        "image": "https://i.ibb.co/dDwXK8Y/Akishika.jpg",
        "title": "Akishika",
        "description": "Osaka is the second smallest prefecture in Japan, with an area of only 1,892 km2. It’s neighbours are the prefectures of Hyogo and Kyoto in the North, Nara in the East and Wakayama in the South.  Surrounded by mountains to the North, East and South, Osaka Prefecture faces Osaka Bay to the West and is blessed with weather that is generally mild, but that also has four distinct seasons. The Yodo and Yamato Rivers flow through the prefecture and expansive alluvial plains extend around the Yodo River estuary running into Osaka Bay.  Osaka is part of the Kansai region of Japan’s main island Honshu which covers a broad area including the neighbouring cities of Kobe, Kyoto and Nara.  Sake brewing in Osaka began in the Middle ages. Akishika Shuzo was founded in the town of Nose (No-say) in Osaka prefecture in 1886. Under Hiroaki Oku, the present 6th generation Kuramoto [Brewery Owner], this tiny brewery is creating some of Japan’s most exceptional and unique sake. Oku-san is both Kuramoto and also Toji [Master Brewer] at Akishika and his belief and skill in creating quality sake shows in every bottle. Akishika Shuzo own around 50 acres of rice fields with the remaining rice sourced from 20 local farmers. All of the rice is grown by Oku-san and the local farmers is done so organically. Akishika since 2000 have shunned the use of herbicides, pesticides and agricultural chemicals preferring to work organically in their fields. Oku-san makes his own natural fermented fertiliser by reusing the byproducts of rice growing and sake brewing. Utilising rice husks, rice straw, rice bran, sake lees and re-fermenting them. This natural byproduct is then used in the rice cultivation process the following year. Since 2004 Akishika Shuzo have only brewed Junmai [pure rice] sake. It was at that time Oku-san decided to stop charcoal filtering, thus all of his sake are Muroka = no charcoal filtration. A year later he stopped filtering altogether. This is to retain as much of the purity and abundant umami in the rice that he grows. All of the sake Oku-san creates are full of umami and have great structure, acidity and body which lends these brews to be well suited to ageing. Akishika Shuzo have roughly 2 years worth of production ageing at any one time, a massive investment particularly for such a small brewery. Oku-san will only release his sake when he believes they are ready and he believes that at 5 - 10 years of age his sake really starts to shine. Sake from Akishika Shuzo have a cult status in Japan, so when Akishika does release sake they sell out exceptionally quickly. We feel extremely privileged to bring these amazing products to Australia.",
        "tags": [],
        "categories": ["selected sake"],
        "myfevorite": [],
        "comments": [],
        "publishedAt": "jan 31, 2023",
        "modifiedAt": "",
        "createdBy": "Mahabub"
    },
    {
        "image": "https://i.ibb.co/t4XDxNf/Brooklyn-Kura.jpg",
        "title": "Brooklyn Kura",
        "description": "The first Sake Brewery in New York would not have happened if it were not for a chance meeting in Japan. Brandon Doughan and Brian Polen, bonded over a shared love for high quality Sake while traveling the country. They both returned again to apprentice in historic breweries before returning to open Brooklyn Kura, a truly American Sake Brewery with a focus on Namasakes created completely from American sourced products. Blue Door A full-bodied, umami-rich Sake. The rich savory notes are balanced with fruit flavors of banana and ripe melon. Bold enough to pair with salumi, pate and decadent grilled cheese.",
        "tags": [],
        "categories": ["selected sake"],
        "myfevorite": [],
        "comments": [],
        "publishedAt": "jan 31, 2023",
        "modifiedAt": "",
        "createdBy": "Mahabub"
    },
    {
        "image": "https://i.ibb.co/BnYq0KZ/Kaze-no-Mori.jpg",
        "title": "Kaze no Mori",
        "description": "Eating, drinking, dining. The routine of our everyday experience that has continued for as long as the history of humanity. Enriching and enlivening these everyday experiences is the value of Japanese sake. This is the belief that underlies Kaze no Mori. Kaze no Mori was born in 1998, inspired by a desire to offer local people the chance to drink unpasteurized sake made from rice grown locally. The name Kaze no Mori comes from the “Kaze no Mori mountain pass” in Gose City. Situated at the foot of the lush green Kongo–Katsuragi mountain range, a pleasant wind blows through the area throughout the year. Incorporating the latest technology, as well as building upon, rethinking and renewing the traditions of Nara Sake established 500 years ago, we endeavour to create sake only possible today and undertake the challenge of discovering the sake of the next generation. Through our Kaze no Mori series we discover and express the differences in taste and aroma that arise from changes in rice variety and polishing rate. Through our Kaze no Mori ALPHA series we approach brewing with an open mind and embrace the latest technology on a journey to discover the future possibilities for Japanese sake. Stimulation of the Five Senses. The pop of the cap as the bottle is opened. The clear lemon-yellow hue of the liquid. The small bubbles formed by the residual carbon dioxide. The faint aroma of fruit as you bring the glass closer. The silky thickness of the liquid and medley of tastes that spread across your tongue. The refreshing aromas as you breathe out through your nose. The lingering acidity that cleanses your palate after These are just some of the ways your five senses are stimulated when you take a sip of Kaze no Mori.",
        "tags": [],
        "categories": ["selected sake"],
        "myfevorite": [],
        "comments": [],
        "publishedAt": "jan 31, 2023",
        "modifiedAt": "",
        "createdBy": "Mahabub"
    },
    {
        "image": "https://i.ibb.co/fMTxMpf/Phoenix.jpg",
        "title": "Phoenix",
        "description": "Tatenokawa and the French rock band Phoenix decided to collaborate out of respect and gratitude to Mr. Kuroda who spent many years working hard to promote sake in Europe. Christian Mazzalai says “Mr. Kuroda was a great master who taught all the beauties of life which include sake, and is still inspiring us every day.”A portion of sales from the sake will be donated to the Japanese Red Cross Society to support the progression of medical technology.",
        "tags": [],
        "categories": ["selected sake"],
        "myfevorite": [],
        "comments": [],
        "publishedAt": "jan 31, 2023",
        "modifiedAt": "",
        "createdBy": "Mahabub"
    },
    {
        "image": "https://i.ibb.co/HFtyxTd/Mushroom-Butter-Fried-Rice.jpg",
        "title": "Mushroom Butter Fried Rice",
        "description": "A special dish today that combines two of our all time favorites - Garlic Butter and Rice! This recipe begins with cooking LOTS of fresh garlic in butter, then caramelizing mushrooms, stir frying with flavorings and then finishing off with additional butter for a buttery mouth feel. You know its a good one if it begins with butter and garlic! There is something about garlic butter and carbs - not healthiest but so delicious. Fried rice has always been our family favorite. It is quick, makes easy lent dinner recipe, great way to use whatever you have in the refrigerator, filling, comforting and economical. Looking for more? Check out chicken fried rice or better than take out fried rice. Any cooked white rice that you have on hand will work. It will be great if it is day-old. Though jasmine is traditional, basmati is a great replacement as well. In fact, fried rice dishes are usually a way to re-purpose leftovers . You just don’t want hot one. Cold, refrigerated, preferably day old is perfect. Hot cooked grain will turn slightly mushy when stir fried, so it is important for it to be cold or room temperature. If you don’t have cold rice from the day before, then spread hot cooked grains on sheet trays and let it hang out at room temperature for couple of hours to help it dry. Don't have cold rice? We have made it with room temperature one and it still tastes amazing. Low and then High - Unlike traditional recipes, we begin by cooking chopped garlic in butter over low heat until they get pale golden in color. This takes the bite off of it, as well as to release its aromas and flavors into the butter, which will then perfume the dish with the garlicky goodness. Add vegetables and increase heat to high to caramelize them. This recipe can be made in under 20 minutes - Heat butter over medium-low heat and saute minced garlic just for a few seconds (you will begin to smell the incredible garlicky aroma). Add chopped onion, sliced veggies and red pepper flakes and cook in high heat, until cooked and looks caramelized. Stir fry cooked grain, scallions, soy sauce, salt, pepper and more butter, until thoroughly combined. Enjoy!",
        "tags": [],
        "categories": ["specials"],
        "myfevorite": [],
        "comments": [],
        "publishedAt": "jan 31, 2023",
        "modifiedAt": "",
        "createdBy": "Mahabub"
    },
    {
        "image": "https://i.ibb.co/b3SnK47/Sake-Clams-Vongole-Ramen.jpg",
        "title": "Sake Clams Vongole Ramen",
        "description": "I have been meaning to test this recipe for a while now and finally got to it tonight. I was looking for a light dinner after all that Thanksgiving stuffing and found this recipe to be a perfect dinner when accompanied by a salad. I used mahogany clams but, although flavorful, they were a bit large and chewy. Next time, I will try to get “steamers” as I think they are the perfect size for this recipe. I served this dish with some warm bread and a glass of chilled sake. I found the clams and the broth had a hint of sake and ginger which when combined with the sweetness of the clams, was delicious. Seafood lovers and Asian flavor lovers, this recipe is for you! The process for cleaning the clams worked like a charm. Of course, fresh clams are of the utmost importance here. This dish was so easy to prepare. I used Junmai sake for cooking since Junmai is pure enough for the flavour (kind of like using only wine you would drink in cooking and using virgin olive oil and saving the extra virgin one for finishing). When strong ginger aromas wafted throughout the kitchen during the cooking of the clams, I was expecting overpowering ginger flavor. That was not the case. The littleneck clams were succulent and the broth was clean yet flavorful with a hint of ginger aftertaste. I served mine with white soy, scallions, and chile flake soba noodles. Paired wonderfully with Junmai Ginjo sake. If you’re more of a wine drinker, Sauvignon Blanc or Sancerre would also do the trick. I tried! We really enjoyed this recipe. Initially paired with Junmai Ginjo sake and it was a great pairing. We had an open bottle of Sancerre and I was going to need Sauvignon Blanc for another recipe so we tried these as well and although the sake was the better option, the wines worked as well. This one is going on my seafood rotation.",
        "tags": [],
        "categories": ["specials"],
        "myfevorite": [],
        "comments": [],
        "publishedAt": "jan 31, 2023",
        "modifiedAt": "",
        "createdBy": "Mahabub"
    },
    {
        "image": "https://i.ibb.co/wYfPR1r/Spaghetti-with-Parmigiano.jpg",
        "title": "Spaghetti with Parmigiano",
        "description": "Let’s begin with some clarifying vocabulary: “Parmesan” is a style of cheese (like “cheddar” and “mozzarella”), and “Parmigiano-Reggiano” is the world’s best variety of this cheese, only produced in Italy, exclusively in Bologna, Modena, Parma, and Reggio Emilia. Its moniker is “the king of cheese,” and that is no hyperbole. Almost everything in Italy is finished with a fresh grating of Parmesan, except spicy foods and seafood dishes (try asking for cheese to top one of these dishes in Italy; it's more than likely that they will flat-out refuse you). It’s sweet/salty/nutty flavor is an undeniable flavor enhancer to so many savory dishes. But there's a big difference between Parmesans produced domestically (and in some non-Italian countries, like Australia and Argentina) and those from parts Italy’s famed Emilia-Romagna region. To understand the variables, I have highlighted the categories in which Parmigiano-Reggiano excels over its Parmesan peers: Time: Most Parmigiano-Reggiano is aged for two years or more (domestic versions are likely six months to a year). This prolonged aging process not only helps develop the cheese’s tell-tale nutty and salty flavors, it also helps create beautiful, crystalline clusters within the cheese (a transformation of milk proteins), which adds crunch and character. For Parmigianos aged for three years (called “stravecchios”), it's better to nibble it in craggily chunks as part of an appetizer or antipasto platter, so you get the full benefit of its textural superiority. Purity: Two words: “wood pulp.” Last year, that is what food scientists found mixed into tubs of pre-grated domestic Parmesan cheeses sold in the supermarket. I guess trees are cheaper than cheese, but when you buy a block of Parmigiano-Reggiano, there is no room for such flimflammery. Just 100% pure salty goodness. Leave those green foiled-wrapped canisters on the non-refrigerated shelves. Oversight: Like with so many of the EU’s prized foodstuffs—champagne, aged balsamic vinegar, San Marzano tomatoes, prosciutto di Parma—there are specific consortiums in place to regulate their production so they are consistent in their superior quality. Parmigiano-Reggiano is one of these “protected designation of origin” foods (often labeled DOP), meaning it can only be called “Parmigiano-Reggiano” if its production follows the rigorous standards set forth by the consortium that oversees it. This includes strict rules for the location of the dairy farms and the diet of the cows that provide the milk; the weight, size, and color of the cheese wheels; the aging length; and its final texture and aroma. That is why every wedge of Parmigiano-Reggiano you buy is consistently delicious. The Rind: This is how you, the consumer, will tell that the cheese you are buying is true Parmigiano-Reggiano: Every giant wheel of cheese is stamped with the words “Parmigiano Reggiano” over every inch of the rind, so no matter how small a piece of cheese you're buying, you will see some of the letters of the name. Without it, it isn't the real deal. Also, save the rind! Because the rind is naturally formed during the aging process, it is completely edible. That doesn’t mean it has a great texture (it’s hard and a bit waxy), but it's packed with flavor. Slip it into your next vegetable soup, pot of white beans or chickpeas, or a simmering tomato sauce, to lend a saltiness richness. It won’t melt, so just fish out and discard before serving. Blocks of Parmigiano-Reggiano have a very long shelf life (usually a year after its cut, due to its low moisture content). It should be stored in the refrigerator in a container that allows it to breathe (like a plastic tub or glass container), and placed in plain sight, since you’ll want to grab it to season your dinner as often as you can. This creamy, dreamy lemon-Parmigiano pasta is the ultimate last-minute meal. The sauce is quickly assembled as the pasta boils away and is made up entirely of items you should always have in your pantry: dry pasta, lemon, Parmigiano-Reggiano, and olive oil. The magic ingredient here is the pasta cooking water, which takes the starch from the cooking pasta and uses it to bind the lemon juice, grated cheese, and olive oil to make a perfect pasta sauce. —Jennifer Clair",
        "tags": [],
        "categories": ["specials"],
        "myfevorite": [],
        "comments": [],
        "publishedAt": "jan 31, 2023",
        "modifiedAt": "",
        "createdBy": "Mahabub"
    },
    {
        "image": "https://i.ibb.co/X2D4qTg/Tofu-and-Sesame-Hot-Pot.jpg",
        "title": "Tofu and Sesame Hot Pot",
        "description": "Yu-Dofu (tofu hot pot) is a very simple and popular home dish in Japan. This version has addition of spinach and enoki mushrooms to boost nutrients and flavors. Yu-Dofu‘s best accompaniment is ponzu, and my quick daidai citrus ponzu tastes so refreshing and aromatic. Then, you can top the tofu with a generous amount of freshly-ground toasted sesame seeds in suribachi and surikogi (Japanese mortar and pestle), which is so nutty and aromatic. Kanzuri (chili condiment from Niigata, Japan) is another great condiment. Combine the kombu and water in a donabe. Let it soak for 30 minutes. Add the enoki mushrooms and tofu. Set the donabe over medium heat. Bring to a simmer. Remove the kombu, and add the spinach. Once the spinach is wilted, turn off the heat. The dish is ready to serve. Serve the tofu, enoki, and spinach into individual serving bowls. Serve with green onion, ponzu, sesame seeds as condiments. Dab a little amount of kanzuri to tofu and other ingredients, if you like.",
        "tags": [],
        "categories": ["specials"],
        "myfevorite": [],
        "comments": [],
        "publishedAt": "jan 31, 2023",
        "modifiedAt": "",
        "createdBy": "Mahabub"
    }
]